app/controllers/employees_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."user_id" = ? ORDER BY "employees"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "employees" WHERE "employees"."user_id" = ?  [["user_id", 1]]
---
  def index
    @query = current_user.employees.ransack(params[:q])
    @query.sorts = 'created_at desc' if @query.sorts.empty?

INSERT INTO "employees" ("first_name", "last_name", "user_id", "age", "gender", "designation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = current_user.employees.new(employee_params)
    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "first_name" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["first_name", "Beatrice123"], ["updated_at", "2020-07-04 17:06:02.477651"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 1]]
---
  def destroy
    @employee.destroy

SELECT  "employees".* FROM "employees" WHERE "employees"."user_id" = ? AND "employees"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
  def set_employee
    @employee = current_user.employees.find(params[:id])